src/cf/InformationRegisters/СостоянияОбновленияЕНС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СостоянияОбновленияЕНС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СостоянияОбновленияЕНС/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

Функция ПолучитьАктуальноеСостояние(Организация) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.СостоянияОбновленияЕНС.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Организация = Организация;
	МенеджерЗаписи.Прочитать();
	
	ОписаниеАктуальногоСостояния = ДанныеИзJSON(МенеджерЗаписи.Состояние);
	
	Возврат ОписаниеАктуальногоСостояния;
	
КонецФункции

Процедура УстановитьАктуальноеСостояние(Организация, Состояние) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.СостоянияОбновленияЕНС.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Организация = Организация;
	МенеджерЗаписи.Состояние   = ЗначениеВJSON(Состояние);
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Функция ОписаниеАктуальногоСостояния() Экспорт
	
	Описание = Новый Структура;
	Описание.Вставить("КодОшибки",            0);
	Описание.Вставить("РасшифровкаСостояния", "");
	Описание.Вставить("ОтветСервиса",         "");
	
	Состояние = Новый Структура;
	Состояние.Вставить("Дата",     Дата(1, 1, 1));
	Состояние.Вставить("Статус",   "");
	Состояние.Вставить("Описание", Описание);
	
	Возврат Состояние;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеИзJSON(Строка)
	
	Если Не ЗначениеЗаполнено(Строка) Тогда
		Возврат ОписаниеАктуальногоСостояния();
	КонецЕсли;
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Строка);
	Возврат ПрочитатьJSON(ЧтениеJSON);
	
КонецФункции

Функция ЗначениеВJSON(Данные)
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Данные);
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

#КонецОбласти

#КонецЕсли
